app/views/posters/_poster.html.erb

        <ul>
          <% poster.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_posters" ON "users"."id" = "user_posters"."user_id" WHERE "user_posters"."poster_id" = $1  [["poster_id", 1]]

      <ul>
        <% poster.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "poster_tags" ON "tags"."id" = "poster_tags"."tag_id" WHERE "poster_tags"."poster_id" = $1  [["poster_id", 1]]