app/views/posters/show.html.erb

    <ul class="poster-users">
      <% @poster.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_posters" ON "users"."id" = "user_posters"."user_id" WHERE "user_posters"."poster_id" = $1  [["poster_id", 1]]