app/controllers/posters_controller.rb

SELECT "posters".* FROM "posters"
---
  def index
    @posters = Poster.all

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "posters".* FROM "posters"  WHERE "posters"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @comments = Rails.cache.fetch("poster-#{params[:id]}") { Poster.find(params[:id]).includes(:comments) }.comments